================================================================================
link-00: Standalone link
================================================================================
{word}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (uri))
    (paragraph_break)))

================================================================================
link-01: norg file type target
================================================================================
{:word:}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (norg_file
        path: (path)))
    (paragraph_break)))

================================================================================
link-02: norg file type target with current workspace root
================================================================================
{:$/word:}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (norg_file
        root: (current_workspace)
        path: (path)))
    (paragraph_break)))

================================================================================
link-03: norg file type target with workspace root
================================================================================
{:$word/word:}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (norg_file
        root: (workspace)
        path: (path)))
    (paragraph_break)))

================================================================================
link-04: norg file type target with file root
================================================================================
{:/word:}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (norg_file
        root: (file_root)
        path: (path)))
    (paragraph_break)))

================================================================================
link-05: scope type target (heading)
================================================================================
{** word}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (scope
        (link_scope_heading
          (heading_prefix)
          (title
            (word)))))
    (paragraph_break)))

================================================================================
link-06: scope type target (footnote)
================================================================================
{^ word}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (scope
        (link_scope_footnote
          (footnote_prefix)
          (title
            (word)))))
    (paragraph_break)))

================================================================================
link-07: scope type target (definition)
================================================================================
{$ word}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (scope
        (link_scope_definition
          (definition_prefix)
          (title
            (word)))))
    (paragraph_break)))

================================================================================
link-08: multiple scoped target
================================================================================
{* word : ** word : ^ word}
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (scope
        (link_scope_heading
          (heading_prefix)
          (title
            (word)))
        (link_scope_heading
          (heading_prefix)
          (title
            (word)))
        (link_scope_footnote
          (footnote_prefix)
          (title
            (word)))))
    (paragraph_break)))

================================================================================
link-09: LTR rule 1
================================================================================
`{* heading`}
--------------------------------------------------------------------------------
(document
  (paragraph
    (verbatim
      (verbatim_open)
      (punctuation)
      (punctuation)
      (whitespace)
      (word)
      (verbatim_close))
      (punctuation)
    (paragraph_break)))

================================================================================
link-10: don't break attached modifier
================================================================================
{* /heading} /italic/
--------------------------------------------------------------------------------
(document
  (paragraph
    (link
      target: (scope
        (link_scope_heading
          (heading_prefix)
          (title
            (open_conflict
              (italic_open)
              (word))))))
    (whitespace)
    (italic
      (italic_open)
      (word)
      (italic_close))
    (paragraph_break)))

; vim:ts=2:sw=2:
